60000 train samples
10000 test samples
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_3 (Dense)              (None, 512)               401920    
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 10)                5130      
=================================================================
Total params: 669,706
Trainable params: 669,706
Non-trainable params: 0
_________________________________________________________________
Epoch 1/20
469/469 [==============================] - 5s 10ms/step - loss: 0.2457 - accuracy: 0.9240 - val_loss: 0.1036 - val_accuracy: 0.9676
Epoch 2/20
469/469 [==============================] - 5s 10ms/step - loss: 0.1024 - accuracy: 0.9695 - val_loss: 0.0967 - val_accuracy: 0.9712
Epoch 3/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0754 - accuracy: 0.9772 - val_loss: 0.0710 - val_accuracy: 0.9787
Epoch 4/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0600 - accuracy: 0.9819 - val_loss: 0.0678 - val_accuracy: 0.9812
Epoch 5/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0516 - accuracy: 0.9843 - val_loss: 0.0748 - val_accuracy: 0.9810
Epoch 6/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0421 - accuracy: 0.9876 - val_loss: 0.0822 - val_accuracy: 0.9803
Epoch 7/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0374 - accuracy: 0.9888 - val_loss: 0.0924 - val_accuracy: 0.9793
Epoch 8/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0341 - accuracy: 0.9898 - val_loss: 0.0852 - val_accuracy: 0.9826
Epoch 9/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0305 - accuracy: 0.9908 - val_loss: 0.0869 - val_accuracy: 0.9816
Epoch 10/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0290 - accuracy: 0.9918 - val_loss: 0.0933 - val_accuracy: 0.9825
Epoch 11/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0257 - accuracy: 0.9925 - val_loss: 0.0927 - val_accuracy: 0.9830
Epoch 12/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0253 - accuracy: 0.9931 - val_loss: 0.0887 - val_accuracy: 0.9837
Epoch 13/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0236 - accuracy: 0.9934 - val_loss: 0.0979 - val_accuracy: 0.9809
Epoch 14/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0212 - accuracy: 0.9938 - val_loss: 0.0894 - val_accuracy: 0.9842
Epoch 15/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0189 - accuracy: 0.9947 - val_loss: 0.1142 - val_accuracy: 0.9816
Epoch 16/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0187 - accuracy: 0.9946 - val_loss: 0.1128 - val_accuracy: 0.9842
Epoch 17/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0180 - accuracy: 0.9953 - val_loss: 0.1099 - val_accuracy: 0.9841
Epoch 18/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0176 - accuracy: 0.9953 - val_loss: 0.1160 - val_accuracy: 0.9830
Epoch 19/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0167 - accuracy: 0.9955 - val_loss: 0.1246 - val_accuracy: 0.9816
Epoch 20/20
469/469 [==============================] - 5s 10ms/step - loss: 0.0159 - accuracy: 0.9955 - val_loss: 0.1259 - val_accuracy: 0.9827
Test loss: 0.12592118978500366
Test accuracy: 0.982699990272522